https://github.com/okovtun/PD_411_CS.git
https://www.youtube.com/playlist?list=PLeqyOOqxeiINOiKYh0YejB9GISCy2h6oT

TOREAD:
https://ru.wikipedia.org/wiki/%D0%92%D0%B5%D0%BD%D0%B3%D0%B5%D1%80%D1%81%D0%BA%D0%B0%D1%8F_%D0%BD%D0%BE%D1%82%D0%B0%D1%86%D0%B8%D1%8F

TODO:
1. Почитать про Длинную арифметику и применить ее к Факториалу;
2. Список должен создаваться так:
	ForwardList list = new ForwardList() { 3, 5, 8, 13, 21 };
3. Список должен выводиться на экран вот так:
	foreach(int i in list)
	{
		Console.Write($"{i}\t");
	}
4. Реализовать класс 'List', описывающий двусвзный список;

DONE:
1. Создать ветку 'Triangle', и в ней добавить в нашу иерархию, иерархию треугольников;
2. Попробуйте сделать генерацию фигур в случайном порядке;

DONE:
Реализовать иерархию геометрических фигур: квадрат, треугольник, круг, прямоугольник......
Для каждой фигуры вывести ее первичные свойства, такие как длина сторон, радиус .....
и вторичные свойства: Площадь, Периметр.....
Так же, каждую фигуру нужно нарисовать.
Фигуры нужно генерировать в случайном порядке, со случайными свойствами.

DONE:
1. Почитать про *.CSV формат;
2. Прочитать группу из файла, и загрузить ее в такой же массив объектов;

DONE:
1. В иерархию классов 'Academy' добаввить класс 'Graduate' - Дипломник и 'Specialist';

DONE:
1. В классе 'Point' написать оператор '-', который возвращает расстояние между двумя точками;
2. В Solution 'OOP' добавить проект 'Fraction', и в нем реализовать класс 'Fraction', который
   описывает простую дробь. В классе реализовать все необходимые методы и операторы;

TODO:
1. Прикрутить скобки;

DONE:
1. Вывести Ромб на экран при помощи одного, а не двух основных циклов;
2. Вывести Шахматную доску на экран при помощи двух основных циклов;

DONE:
1. Написать программу, в которой пользователь нажимает клавиши WASD или клавиши курсора (стрелки)
	и при этом курсор двигается в нужном направлении. Курсор можно обозначить любым символом;
2. Написать калькулятор, который вычисляет простейшие арифметические выражения вида:
	2 + 3 = ????
3. В проекте 'Geometry' пользователь вводит размер фигуры, и программа выводит на экран следующие фигуры:
	* * * * * 
	* * * * * 
	* * * * * 
	* * * * * 
	* * * * * 

	*
	* * 
	* * * 
	* * * *
	* * * * *

	* * * * *
	* * * *
	* * *
	* *
	*

	* * * * *
	  * * * *
	    * * *
		  * *
		    *

			*
		  * *
		* * *
	  * * * *
	* * * * *

	    /\
	   /  \
	  /    \
	 /      \
	/        \
	\        /
	 \      /
	  \    /
	   \  /
	    \/


	* * * * *          * * * * *          * * * * *          * * * * *          
	* * * * *          * * * * *          * * * * *          * * * * *          
	* * * * *          * * * * *          * * * * *          * * * * *          
	* * * * *          * * * * *          * * * * *          * * * * *          
	* * * * *          * * * * *          * * * * *          * * * * *          
	         * * * * *          * * * * *          * * * * *          * * * * *
	         * * * * *          * * * * *          * * * * *          * * * * *
	         * * * * *          * * * * *          * * * * *          * * * * *
	         * * * * *          * * * * *          * * * * *          * * * * *
	         * * * * *          * * * * *          * * * * *          * * * * *
	* * * * *          * * * * *          * * * * *          * * * * *          
	* * * * *          * * * * *          * * * * *          * * * * *          
	* * * * *          * * * * *          * * * * *          * * * * *          
	* * * * *          * * * * *          * * * * *          * * * * *          
	* * * * *          * * * * *          * * * * *          * * * * *          
	         * * * * *          * * * * *          * * * * *          * * * * *
	         * * * * *          * * * * *          * * * * *          * * * * *
	         * * * * *          * * * * *          * * * * *          * * * * *
	         * * * * *          * * * * *          * * * * *          * * * * *
	         * * * * *          * * * * *          * * * * *          * * * * *
	* * * * *          * * * * *          * * * * *          * * * * *          
	* * * * *          * * * * *          * * * * *          * * * * *          
	* * * * *          * * * * *          * * * * *          * * * * *          
	* * * * *          * * * * *          * * * * *          * * * * *          
	* * * * *          * * * * *          * * * * *          * * * * *          
	         * * * * *          * * * * *          * * * * *          * * * * *
	         * * * * *          * * * * *          * * * * *          * * * * *
	         * * * * *          * * * * *          * * * * *          * * * * *
	         * * * * *          * * * * *          * * * * *          * * * * *
	         * * * * *          * * * * *          * * * * *          * * * * *
	* * * * *          * * * * *          * * * * *          * * * * *          
	* * * * *          * * * * *          * * * * *          * * * * *          
	* * * * *          * * * * *          * * * * *          * * * * *          
	* * * * *          * * * * *          * * * * *          * * * * *          
	* * * * *          * * * * *          * * * * *          * * * * *          
	         * * * * *          * * * * *          * * * * *          * * * * *
	         * * * * *          * * * * *          * * * * *          * * * * *
	         * * * * *          * * * * *          * * * * *          * * * * *
	         * * * * *          * * * * *          * * * * *          * * * * *
	         * * * * *          * * * * *          * * * * *          * * * * *
       
	

DONE:
1. В проекте 'DataTypes' вывести следующую информацию о каждом типе данных:
	- имя класса-обвертки;
	- объем занимаемой памяти;
	- диапазон принимаемых значений;
2. Залить проект на GitHub;
3. В журнал прислать ссылку на репозиторий;